// *****************************************************************************************************************************************************************************************************
// [処理概要]
//   自己評価管理画面
// *****************************************************************************************************************************************************************************************************
class SelfEvaluationAdminScreen extends AdminScreenModel{
    
    getScreenName = () =>{return "自己管理画面";};
    
    // ****************************************************************************************************************
    // [処理概要]                                                                                                     *
    //   実績データを取得する                                                                                         *
    // [返り値]                                                                                                       *
    //   実績データ(連想配列)                                                                                         *
    //   [多次元配列構成]                                                                                             *
    //     Array[tier]{ "データのカラム" : どの行にインプットボックスとラベルを表示するか(同じ行の場合は同じ値を指定) *
    //     Array[data]    : テーブルに表示するデータ                                                                  *
    //      Array[data][] : テーブルに表示するデータのレコード番号                                                    *
    //      Array[data][]{ "データのカラム" : カラムに対応したテーブルに表示するデータ }                              *
    // ****************************************************************************************************************
    getData(){
        
        let data = [];
        let tier = {
            "自己評価コード":1,
            "評価項目"      :2,
            "P"             :3,
            "EXP"           :3,
            "説明"          :4,
        };
        
        data[0] = {
                   "自己評価コード":"T001"             ,
                   "評価項目"      :"遅刻なし"         ,
                   "P"             : 1200              ,
                   "EXP"           : 202               ,
                   "説明"          : "これは説明です。",
                   };
        return {"data":data,"tier":tier};
    }
    
    // ****************************************************************************************************************
    // [処理概要]                                                                                                     *
    //   ラベル作成後の追加処理                                                                                       *
    // [引数]                                                                                                         *
    //   elem  : 作成されるラベルの要素                                                                               *
    //   key   : 作成されるラベルのカラム名                                                                           *
    //   frame : 作成されるラベルを入れるフレーム要素                                                                 *
    // [返り値]                                                                                                       *
    //   作成されるラベルの要素                                                                                       *
    // ****************************************************************************************************************
    LabelCreateCallBack(elem,key,frame){
        
        // カラム名によって処理を切り替え
        switch(key){
            
            case "説明":
                
                // ラベルが左下に行くのを防ぐ
                elem.style.verticalAlign = "top";
                
            break;
            
        }
        
        // 何もしないで返す
        return elem;
        
    }
    
    // ****************************************************************************************************************
    // [処理概要]                                                                                                     *
    //   インプットボックス作成後の追加処理                                                                           *
    // [引数]                                                                                                         *
    //   elem  : 作成されるラベルの要素                                                                               *
    //   key   : 作成されるラベルのカラム名                                                                           *
    //   frame : 作成されるラベルを入れるフレーム要素                                                                 *
    // [返り値]                                                                                                       *
    //   作成されるインプットボックスの要素                                                                           *
    // ****************************************************************************************************************
    InputBoxCreateCallBack(elem,key,frame){
        
        // カラム名によって処理を切り替え
        switch(key){
            
            case "説明":
                
                // インプットボックスをテキストエリアに変更
                let explanation                 = document.createElement("textarea");
                explanation.id                  = elem.id                           ;
                explanation.style.width         = elem.style.width                  ;
                explanation.style.height        = 200                               ;
                explanation.style.width         = 325                               ;
                
                // テキストエリア要素を返す
                return explanation;
                
            break;
            
        }
        
        // 何もしないで返す
        return elem;
        
    }
    
}
